export const PAGES = {
    frontend: {
        hero: {
            title: "JavaScript Frontend",
            subtitle: "Разработка web приложений",
            description: [
                "3 месяца/ 5 раз в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 1 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет освоить",
                    orange: "творческую профессию с нуля"
                },
                text: `Вы получите все необходимые 
                инструменты для быстрого старта в UX/UI-дизайне, 
                научитесь мыслить и действовать креативно и соберете 
                портфолио, которое впечатлит работодателей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "сменить рутину на креативные задачи"
                },
                text: `Вы освоите востребованную профессию 
                и получите новые возможности для реализации идей. 
                Научитесь проводить исследования и сможете создавать 
                крутые интерфейсы с нуля, опираясь на опыт пользователей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "стать фрилансером и работать на себя"
                },
                text: `Вы узнаете, как разрабатывать цифровые 
                продукты от идеи до готового макета, разберетесь 
                в бизнес-требованиях, сможете проводить исследования 
                и работать с гипотезами. А еще – находить клиентов и 
                работать без офиса из любой точки мира.`,
            },
        ],
        market: {
            title: "Frontend",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Крутая атмосферра обучения у нас в офисе OGOGO",
                    text: `Обучение будет проходить в уютном 
                    офисе в самом центре города. Вместе с 
                    крутыми менторами. Вы сможете войти в 
                    мир айти вместе с нами.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в 
                    любой момент, не только во время занятий – наши 
                    эксперты всегда на связи. А еще получите обратную 
                    связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты 
                    подберут для вас подходящие вакансии, помогут оформить 
                    резюме и подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта 
                    под руководством опытных наставников. А после выпуска 
                    получите диплом о профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Frontend",
            text: `Frontend-разработчик отвечает за внешний вид сайта 
            или мобильного приложения: он верстает шаблоны, красиво 
            оформляет текст и изображения, улучшает взаимодействие 
            пользователя с интерфейсом. Без frontend-разработчика 
            не получится создать удобный цифровой продукт.`,
            courses: [
                "Основы языка разметки HTML",
                "Основы таблиц стилей CSS",
                "Основы языка JavaScript",
                "Работа с менеджером пакетов npm",
                "Асинхронные запросы",
                "Объектно-ориентированное программирование (ООП) в JavaScript",
                "Настройка среды разработки и первое React-приложение",
                "Работа с API",
            ],
        },
    },

    pythonBackend: {
        hero: {
            title: "Python backend",
            subtitle: "Покажи своё воображение",
            description: [
                "3 месяца/ 5 раз в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 1 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Новичкам в",
                    orange: "программировании"
                },
                text: `Даже если вы никогда не работали в IT, 
                вы получите востребованную и высокооплачиваемую 
                специальность.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет работать с ",
                    orange: "серверными задачами"
                },
                text: "Вы будете активно взаимодействовать с серверами.",
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "стать фрилансером и работать на себя"
                },
                text: `Вы узнаете, как разрабатывать цифровые продукты от идеи до готового макета, 
                разберетесь в бизнес-требованиях, сможете проводить исследования и 
                работать с гипотезами. А еще – находить клиентов и работать без офиса из любой точки мира.`,
            },
        ],
        market: {
            title: "Backend разработчики",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Крутая атмосферра обучения у нас в офисе OGOGO",
                    text: `Обучение будет проходить в уютном 
                    офисе в самом центре города. Вместе с 
                    крутыми менторами. Вы сможете войти в 
                    мир айти вместе с нами. `,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, 
                    не только во время занятий – наши эксперты всегда на связи. 
                    А еще получите обратную связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты подберут 
                    для вас подходящие вакансии, помогут оформить резюме и 
                    подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под руководством 
                    опытных наставников. А после выпуска получите диплом о 
                    профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Основы backend разработки. Погружение в профессию",
            text: `Получите одну из самых востребованных IT-профессий. Вы освоите Python, 
            научитесь писать программы и веб-приложения. Реализуете 4 проекта для портфолио.`,
            courses: [
                "Знакомство с Python",
                "Linux. Рабочая станция",
                "HTML/CSS. Интерактивный курс",
                "Клиент-серверные приложения на Python",
                "Паттерны веб-представления",
                "Архитектура и шаблоны проектирования на Python",
                "Декораторы и продолжение работы с сетью",
                "Работа с портфолио",
            ],
        },
    },
    projectManager: {
        hero: {
            title: "Project management",
            subtitle: "Управляй айти проектами",
            description: [
                "4 месяца/ 3 раза в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 2 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет сменить свою",
                    orange: "профессию"
                },
                text: "Подготовитесь к успешному карьерному старту в топовой компании.",
            },
            {
                subtitle: {
                    black: "Выйти на",
                    orange: "новый уровень"
                },
                text: "На практике потренируете hard и soft skills, чтобы вести проекты эффективнее ",
            },
            {
                subtitle: {
                    black: "Создать или развить свой",
                    orange: "бизнес"
                },
                text: "Сможете понять и проработать внутренние процессы",
            },
        ],
        market: {
            title: "Project manager",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "Проектным менеджерорм с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Подробная программа и актуальные навыки",
                    text: `Вы узнаете, как работает UX- и UI-дизайн для пользователя 
                    и для бизнеса. Освоите Figma. И создадите прототип интерфейса 
                    в качестве дипломной работы.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, не только во время 
                    занятий – наши эксперты всегда на связи. А еще получите обратную 
                    связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты 
                    подберут для вас подходящие вакансии, помогут 
                    оформить резюме и подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под 
                    руководством опытных наставников. А после выпуска 
                    получите диплом о профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Проектный менеджмент. Погружение в профессию",
            text: `Вы сможете реализовывать проекты любой сложности, не выбиваясь из сроков 
            и бюджета. Вы научитесь управлять командами разработчиков 
            и дизайнеров и соберете портфолио из реальных кейсов.`,
            courses: [
                "Вводный урок",
                "История и основные принципы дизайна",
                "Notion 2",
                "Аccessibility",
                "Командная работа",
                "Типографика и композиция в вебе. Расширенный курс",
                "Figma: от проектирования к прототипированию",
                "Работа с портфолио",
            ],
        },
    },
    javaBackend: {
        hero: {
            title: "Java backend",
            subtitle: "Покажи своё воображение",
            description: [
                "4 месяца/ 3 раза в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 2 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет освоить",
                    orange: "творческую профессию с нуля"
                },
                text: `Вы получите все необходимые инструменты для 
                быстрого старта в UX/UI-дизайне, научитесь мыслить и 
                действовать креативно и соберете портфолио, которое 
                впечатлит работодателей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "сменить рутину на креативные задачи"
                },
                text: `Вы освоите востребованную профессию и получите 
                новые возможности для реализации идей. Научитесь проводить 
                исследования и сможете создавать крутые интерфейсы с нуля, 
                опираясь на опыт пользователей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "стать фрилансером и работать на себя"
                },
                text: `Вы узнаете, как разрабатывать цифровые продукты от идеи 
                до готового макета, разберетесь в бизнес-требованиях, сможете 
                проводить исследования и работать с гипотезами. А еще – находить 
                клиентов и работать без офиса из любой точки мира.`,
            },
        ],
        market: {
            title: "UX UI дизайнеры",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Подробная программа и актуальные навыки",
                    text: `Вы узнаете, как работает UX- и UI-дизайн для 
                    пользователя и для бизнеса. Освоите Figma. И создадите 
                    прототип интерфейса в качестве дипломной работы.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, 
                    не только во время занятий – наши эксперты всегда на связи. 
                    А еще получите обратную связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты подберут 
                    для вас подходящие вакансии, помогут оформить резюме 
                    и подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под руководством 
                    опытных наставников. А после выпуска получите диплом 
                    о профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Основы дизайна. Погружение в профессию",
            text: `Вы познакомитесь с ключевыми инструментами, получите представления о визуальной 
            коммуникации и научитесь применять ее на практике, создадите 
            работы в Figma и потренируетесь в оформлении портфолио.`,
            courses: [
                "Вводный урок",
                "История и основные принципы дизайна",
                "Notion 2",
                "Аccessibility",
                "Командная работа",
                "Типографика и композиция в вебе. Расширенный курс",
                "Figma: от проектирования к прототипированию",
                "Работа с портфолио",
            ],
        },
    },
    android: {
        hero: {
            title: "Android mobile",
            subtitle: "Покажи своё воображение",
            description: [
                "4 месяца/ 3 раза в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 2 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет освоить",
                    orange: "творческую профессию с нуля"
                },
                text: `Вы получите все необходимые инструменты для быстрого старта в UX/UI-дизайне, 
                научитесь мыслить и действовать креативно и соберете 
                портфолио, которое впечатлит работодателей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "сменить рутину на креативные задачи"
                },
                text: `Вы освоите востребованную профессию и 
                получите новые возможности для реализации идей. 
                Научитесь проводить исследования и сможете создавать крутые интерфейсы 
                с нуля, опираясь на опыт пользователей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "стать фрилансером и работать на себя"
                },
                text: `Вы узнаете, как разрабатывать цифровые продукты от идеи до 
                готового макета, разберетесь в бизнес-требованиях, сможете проводить 
                исследования и работать с гипотезами. А еще – находить клиентов и работать 
                без офиса из любой точки мира.`,
            },
        ],
        market: {
            title: "UX UI дизайнеры",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Подробная программа и актуальные навыки",
                    text: `Вы узнаете, как работает UX- и UI-дизайн для пользователя и 
                    для бизнеса. Освоите Figma. И создадите прототип интерфейса 
                    в качестве дипломной работы.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, не только во время 
                    занятий – наши эксперты всегда на связи. А еще получите 
                    обратную связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты подберут 
                    для вас подходящие вакансии, помогут оформить резюме и 
                    подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под руководством 
                    опытных наставников. А после выпуска получите диплом о 
                    профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Основы дизайна. Погружение в профессию",
            text: `Вы познакомитесь с ключевыми инструментами, 
            получите представления о визуальной коммуникации и 
            научитесь применять ее на практике, создадите работы в 
            Figma и потренируетесь в оформлении портфолио.`,
            courses: [
                "Вводный урок",
                "История и основные принципы дизайна",
                "Notion 2",
                "Аccessibility",
                "Командная работа",
                "Типографика и композиция в вебе. Расширенный курс",
                "Figma: от проектирования к прототипированию",
                "Работа с портфолио",
            ],
        },
    },
    html: {
        hero: {
            title: "HTML/CSS",
            subtitle: "Покажи своё воображение",
            description: [
                "4 месяца/ 3 раза в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 2 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет освоить",
                    orange: "творческую профессию с нуля"
                },
                text: `Вы получите все необходимые инструменты для 
                быстрого старта в UX/UI-дизайне, научитесь мыслить и 
                действовать креативно и соберете портфолио, которое 
                впечатлит работодателей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "сменить рутину на креативные задачи"
                },
                text: `Вы освоите востребованную профессию и получите новые 
                возможности для реализации идей. Научитесь проводить 
                исследования и сможете создавать крутые интерфейсы 
                с нуля, опираясь на опыт пользователей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет стать",
                    orange: "фрилансером и работать на себя"
                },
                text: `Вы узнаете, как разрабатывать цифровые продукты от 
                идеи до готового макета, разберетесь в бизнес-требованиях, 
                сможете проводить исследования и работать с гипотезами. 
                А еще – находить клиентов и работать без офиса из любой 
                точки мира.`,
            },
        ],
        market: {
            title: "UX UI дизайнеры",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Подробная программа и актуальные навыки",
                    text: `Вы узнаете, как работает UX- и UI-дизайн для пользователя и 
                    для бизнеса. Освоите Figma. И создадите прототип интерфейса в 
                    качестве дипломной работы.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, 
                    не только во время занятий – наши эксперты всегда на связи. 
                    А еще получите обратную связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты подберут 
                    для вас подходящие вакансии, помогут оформить 
                    резюме и подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под руководством 
                    опытных наставников. А после выпуска получите диплом о 
                    профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Основы дизайна. Погружение в профессию",
            text: `Вы познакомитесь с ключевыми инструментами, получите представления 
            о визуальной коммуникации и научитесь применять ее на практике, создадите 
            работы в Figma и потренируетесь в оформлении портфолио.`,
            courses: [
                "Вводный урок",
                "История и основные принципы дизайна",
                "Notion 2",
                "Аccessibility",
                "Командная работа",
                "Типографика и композиция в вебе. Расширенный курс",
                "Figma: от проектирования к прототипированию",
                "Работа с портфолио",
            ],
        },
    },
    design: {
        hero: {
            title: "UX UI дизайну",
            subtitle: "Покажи своё воображение",
            description: [
                "4 месяца/ 3 раза в неделю",
                "4 проекта в портфолио",
                "Трудоустройтво лучших студентов",
                "Вебинары, 2 раза в неделю",
            ],
        },
        description: [
            {
                subtitle: {
                    black: "Тем, кто хочет освоить",
                    orange: "творческую профессию с нуля"
                },
                text: `Вы получите все необходимые инструменты для 
                быстрого старта в UX/UI-дизайне, научитесь мыслить и 
                действовать креативно и соберете портфолио, которое 
                впечатлит работодателей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "сменить рутину на креативные задачи"
                },
                text: `Вы освоите востребованную профессию и получите 
                новые возможности для реализации идей. Научитесь проводить 
                исследования и сможете создавать крутые интерфейсы с нуля, 
                опираясь на опыт пользователей.`,
            },
            {
                subtitle: {
                    black: "Тем, кто хочет",
                    orange: "стать фрилансером и работать на себя",
                },
                text: `Вы узнаете, как разрабатывать цифровые продукты от идеи 
                до готового макета, разберетесь в бизнес-требованиях, сможете 
                проводить исследования и работать с гипотезами. А еще – находить 
                клиентов и работать без офиса из любой точки мира.`,
            },
        ],
        market: {
            title: "UX UI дизайнеры",
            btns: {
                one: true,
                two: false,
            },
        },
        help: {
            title: "UX UI дизайнером с нуля",
            article: [
                {
                    img: false,
                    subtitle: "Подробная программа и актуальные навыки",
                    text: `Вы узнаете, как работает UX- и UI-дизайн для 
                    пользователя и для бизнеса. Освоите Figma. И создадите 
                    прототип интерфейса в качестве дипломной работы.`,
                },
                {
                    img: false,
                    subtitle: "Прямой контакт с преподавателями",
                    text: `Вы можете задать вопрос преподавателям в любой момент, 
                    не только во время занятий – наши эксперты всегда на связи. 
                    А еще получите обратную связь по каждому домашнему заданию.`,
                },
                {
                    img: false,
                    subtitle: "Помощь с трудоустройством",
                    text: `После окончания курса наши hr-специалисты подберут 
                    для вас подходящие вакансии, помогут оформить резюме и 
                    подготовиться к собеседованию.`,
                },
                {
                    img: false,
                    subtitle: "Диплом и портфолио",
                    text: `Во время обучения вы выполните 4 проекта под руководством 
                    опытных наставников. А после выпуска получите диплом о 
                    профессиональной переподготовке.`,
                },
            ],
        },
        training: {
            title: "Основы дизайна. Погружение в профессию",
            text: `Вы познакомитесь с ключевыми инструментами, получите представления 
            о визуальной коммуникации и научитесь применять ее на практике, создадите 
            работы в Figma и потренируетесь в оформлении портфолио.`,
            courses: [
                "Вводный урок",
                "История и основные принципы дизайна",
                "Notion 2",
                "Аccessibility",
                "Командная работа",
                "Типографика и композиция в вебе. Расширенный курс",
                "Figma: от проектирования к прототипированию",
                "Работа с портфолио",
            ],
        },
    }
};


